## 05. Pandas

In [36]:
import pandas as pd

### 조건 필터링

In [37]:
data = {
    '이름': ['홍길동', '김철수', '이영희', '박민수'],
    '점수': [90, 70 , 95, 95],
    '반' : [2,1,1,2]
}
df = pd.DataFrame(data)
df

    이름  점수  반
0  홍길동  90  2
1  김철수  70  1
2  이영희  95  1
3  박민수  95  2

In [5]:
mask = df['점수'] >= 80
filtered = df[mask]
filtered

    이름  점수  반
0  홍길동  90  2
2  이영희  85  1
3  박민수  95  2

In [ ]:
# 여러 조건 결함
# and : &
# or : |
#  not : ~

# & 예시
df[(df["반"]== 2) & (df["점수"] >= 90)]

    이름  점수  반
0  홍길동  90  2
3  박민수  95  2

In [13]:
#  not
df[~(df["점수"] >= 80)]

    이름  점수  반
1  김철수  70  1

In [ ]:
# isin()
# 여러 값 중 하나에 해당하는지 여부를 판단할 때 사용

# ex. 이름이 홍길동 이거나 박민수 이거나 한 경우
# mask = (df["이름"] == "홍길동") | (df["이름"] == "박민수")
mask = df["이름"].isin(["홍길동", "박민수"])
df[mask]

mask2 = ~df["이름"].isin(["홍길동", "박민수"])
df[mask2]

    이름  점수  반
1  김철수  70  1
2  이영희  85  1

In [30]:
# reset_index
# 조건 필터링, 행 삭제 등을 통해 인덱스가 변경됐을 시
# reset_index()를 사용 -> 인덱스가 초기화

mask = (df["반"] == 2) | (df["점수"] >= 90)
df2 = df[mask]
print(df2)

# 인덱스 리셋
df2 = df2.reset_index()
print(df2)

# 기존 인덱스 삭제
df2 = df2.reset_index(drop=True)
print(df2)

   이름  점수  반
1  서연  92  2
3  서준  60  2
   index  이름  점수  반
0      1  서연  92  2
1      3  서준  60  2
   index  이름  점수  반
0      1  서연  92  2
1      3  서준  60  2

In [ ]:
# 실습 1.
df = pd.DataFrame({
    '이름': ['민준','서연','지후','서준','지민'],
    '점수': [78,92,85,60,88],
    '반': [1,2,1,2,1]
})
# 1.
an1 = df[df['점수'] >= 80]
print(an1)
print()
# df['점수] >= 80
# 2.
an2 = df[(df['반'] == 1) & (df['점수'] >= 85)]
print(an2)

   이름  점수  반
1  서연  92  2
2  지후  85  1
4  지민  88  1

   이름  점수  반
2  지후  85  1
4  지민  88  1

In [ ]:
# 3.
an3 = df[df['이름'].isin(['서연','지민'])]
print(an3)
print()
# 4.
an4 = an3.reset_index()
print(an4)
# drop=True 써도 무방하다

   이름  점수  반
1  서연  92  2
4  지민  88  1

   index  이름  점수  반
0      1  서연  92  2
1      4  지민  88  1

In [ ]:
# 5.
an5 = df[(df['점수'] < 80) | (df['반'] == 2)]
print(an5)
print()
# 6.
an6 = an5[an5['점수'] >= 70].reset_index()
print(an6)
# drop=True 써도 무방하다

   이름  점수  반
0  민준  78  1
1  서연  92  2
3  서준  60  2

   index  이름  점수  반
0      0  민준  78  1
1      1  서연  92  2

### 열 추가/ 수정/ 삭제

In [49]:
# 열 추가 및 수정
# df['컬럼명'] = '값'
# 컬럼이 존재하면 수정/ 없으면 추가
data = {
    '이름': ['김철수', '이영희', '박민수'],
    '국어': [90, 80, 70],
    '영어': [85, 78, 92]
}
df = pd.DataFrame(data)
df

    이름  국어  영어
0  김철수  90  85
1  이영희  80  78
2  박민수  70  92

In [50]:
# 같은 값을 한번에 추가
df['반'] = '1반'
df

    이름  국어  영어   반
0  김철수  90  85  1반
1  이영희  80  78  1반
2  박민수  70  92  1반

In [51]:
# 조건문을 통한 추가 
df['국어_합격여부'] = df['국어'] >= 80
df

    이름  국어  영어   반  국어_합격여부
0  김철수  90  85  1반     True
1  이영희  80  78  1반     True
2  박민수  70  92  1반    False

In [52]:
# 리스트/시리즈를 통한 열 추가
df['학번'] = [101, 102, 103]
df

    이름  국어  영어   반  국어_합격여부   학번
0  김철수  90  85  1반     True  101
1  이영희  80  78  1반     True  102
2  박민수  70  92  1반    False  103

In [53]:
# 시리즈의 연산 결과로 새 열 추가
df['총점'] = df['국어'] + df['영어']
df

    이름  국어  영어   반  국어_합격여부   학번   총점
0  김철수  90  85  1반     True  101  175
1  이영희  80  78  1반     True  102  158
2  박민수  70  92  1반    False  103  162

In [56]:
# 기존 값을 한번에 변경
df['영어'] = 100
df

    이름  국어   영어   반  국어_합격여부   학번   총점
0  김철수  90  100  1반     True  101  175
1  이영희  80  100  1반     True  102  158
2  박민수  70  100  1반    False  103  162

In [ ]:
# 새로운 컬럼 추가 시, 행의 개수가 맞지 않으면 에러 발생
# df['새로운 열'] = [1,2] # Error가 발생

In [59]:
# 열 삭제: drop
# 단일 열 삭제
df2 = df.drop('반', axis=1)
df2

    이름  국어   영어  국어_합격여부   학번   총점
0  김철수  90  100     True  101  175
1  이영희  80  100     True  102  158
2  박민수  70  100    False  103  162

In [60]:
# 여러 열 삭제
df3 = df2.drop(['총점', '국어_합격여부'], axis=1)
df3

    이름  국어   영어   학번
0  김철수  90  100  101
1  이영희  80  100  102
2  박민수  70  100  103

In [ ]:
# 원본에서 삭제
df.drop('반', axis=1, inplace=True)
df

    이름  국어   영어  국어_합격여부   학번   총점
0  김철수  90  100     True  101  175
1  이영희  80  100     True  102  158
2  박민수  70  100    False  103  162

In [63]:
# 기타 삭제 방법 (1)
del df['국어']
df

    이름   영어  국어_합격여부   학번   총점
0  김철수  100     True  101  175
1  이영희  100     True  102  158
2  박민수  100    False  103  162

In [68]:
# 기타 삭제 방법 (2)
# deleted = df.pop('영어')
# deleted
print(df)

    이름  국어_합격여부   학번   총점
0  김철수     True  101  175
1  이영희     True  102  158
2  박민수    False  103  162

### 행 추가/수정/삭제

In [69]:
df = pd.DataFrame({
    '이름': ['김철수','이영희'],
    '나이': [23,25]
})
df

    이름  나이
0  김철수  23
1  이영희  25

In [72]:
# 행 추가: concat
# 새 행을 추가하기
new_row = pd.DataFrame([{'이름': '장화', '나이': 25}])
# df = pd.concat([df, new_row])

# 인덱스 재정렬
df = pd.concat([df, new_row], ignore_index=True)
df

    이름  나이
0  김철수  23
1  이영희  25
2   장화  25
3   장화  25

In [74]:
# 여러 행 추가하기
new_rows = pd.DataFrame([{'이름': '김씨', '나이': 30},
                         {'이름': '이씨', '나이': 56}])
df = pd.concat([df,new_rows], ignore_index=True)
df

    이름  나이
0  김철수  23
1  이영희  25
2   장화  25
3   장화  25
4   김씨  30
5   이씨  56
6   김씨  30
7   이씨  56

In [75]:
# 행 수정
# loc, iloc을 활용
df.loc[1] = ["김영희", 34]
df

    이름  나이
0  김철수  23
1  김영희  34
2   장화  25
3   장화  25
4   김씨  30
5   이씨  56
6   김씨  30
7   이씨  56

In [76]:
df.loc[0,"나이"]=18
df

    이름  나이
0  김철수  18
1  김영희  34
2   장화  25
3   장화  25
4   김씨  30
5   이씨  56
6   김씨  30
7   이씨  56

In [78]:
df.loc[1:3,'나이']=15
df

    이름  나이
0  김철수  18
1  김영희  15
2   장화  15
3   장화  15
4   김씨  30
5   이씨  56
6   김씨  30
7   이씨  56

In [79]:
df.loc[1:2, ['이름', '나이']] = [['x',20],['y',10]]
df

    이름  나이
0  김철수  18
1    x  20
2    y  10
3   장화  15
4   김씨  30
5   이씨  56
6   김씨  30
7   이씨  56

In [80]:
# 행 삭제: drop
# axis 기본값 0 => 행 삭제
df2 = df.drop(1).reset_index(drop=True)
df2

    이름  나이
0  김철수  18
1    y  10
2   장화  15
3   김씨  30
4   이씨  56
5   김씨  30
6   이씨  56

In [81]:
# 여러 행 삭제
df3 = df.drop([0,2])
df3

   이름  나이
1   x  20
3  장화  15
4  김씨  30
5  이씨  56
6  김씨  30
7  이씨  56

In [89]:
# 실습 2.
an1 = pd.DataFrame({
    '이름': ['김철수','이영희','박민수'],
    '국어': [90,80,70]
})
# 1.
an1['수학'] = [85,100,88]
print(an1)
print()
# 2.
an2 = an1.drop('이름', axis=1)
print(an2)

    이름  국어   수학
0  김철수  90   85
1  이영희  80  100
2  박민수  70   88

   국어   수학
0  90   85
1  80  100
2  70   88

In [93]:
an3 = pd.DataFrame({
    '제품': ['A','B'],
    '가격': [1000,2000]
})
# 3.
n_row = pd.DataFrame([{'제품': 'C', '가격': 1500}])
an3 = pd.concat([an3, n_row], ignore_index=True)
print(an3)
print()
# 4.
an4 = an3.drop(index=0)
print(an4)

  제품    가격
0  A  1000
1  B  2000
2  C  1500

  제품    가격
1  B  2000
2  C  1500

In [96]:
an5 = pd.DataFrame({
    '과목': ['국어','영어','수학'],
    '점수': [85,90,78]
})
# 5.
an5 = an5[an5['점수'] >= 80]
print(an5)
print()
# 6.
an6 = an5['학년'] = 1
print(an5)

   과목  점수
0  국어  85
1  영어  90

   과목  점수  학년
0  국어  85   1
1  영어  90   1

In [97]:
an7 = pd.DataFrame({
    '이름': ['A','B'],
    '나이': [20,22]
})
import numpy as np
n_row = pd.DataFrame([{'이름': 'C', '나이': 25, '키': np.nan}])
an7 = pd.concat([an7, n_row], ignore_index=True)
print(an7)

  이름  나이   키
0  A  20 NaN
1  B  22 NaN
2  C  25 NaN

In [100]:
an8 = pd.DataFrame({
    '부서': ['영업','기획','개발','디자인'],
    '인원': [3,2,5,1]
})
# 8.
an8 = an8[an8['인원'] > 2]
print(an8)
print()
# 9.
an8['평가'] = '미정'
print(an8)

   부서  인원
0  영업   3
2  개발   5

   부서  인원  평가
0  영업   3  미정
2  개발   5  미정

### 정렬
- 값 기준 정렬: sort_values
- 인덱스 기준 정렬: sort_index

In [101]:
data = {
    '이름': ['홍길동', '김철수', '이영희', '박민수'],
    '점수': [90, 70 , 85, 95],
    '반' : [2,1,1,2]
}
df = pd.DataFrame(data)
df

    이름  점수  반
0  홍길동  90  2
1  김철수  70  1
2  이영희  85  1
3  박민수  95  2

In [107]:
# 오름차순 정렬
df2 = df.sort_values('점수').reset_index(drop=True)
df2

    이름  점수  반
0  김철수  70  1
1  이영희  85  1
2  홍길동  90  2
3  박민수  95  2

In [103]:
# 내림차순 정렬
# ascending = False
df3 = df.sort_values('점수', ascending=False).reset_index(drop=True) 
df3

    이름  점수  반
0  박민수  95  2
1  홍길동  90  2
2  이영희  85  1
3  김철수  70  1

In [104]:
# 여러 기준으로 정렬
df4 = df.sort_values(['반','점수'], ascending=[True, False]).reset_index(drop=True)
df4

    이름  점수  반
0  이영희  85  1
1  김철수  70  1
2  박민수  95  2
3  홍길동  90  2

In [109]:
# 원본 변경
df.sort_values(['반','점수'], ascending=[True, False], inplace=True)
df2 = df.reset_index(drop=True)
df2

    이름  점수  반
0  이영희  85  1
1  김철수  70  1
2  박민수  95  2
3  홍길동  90  2

In [112]:
# 인덱스 기준 정렬: sort_index()
df_shuffled = df.sample(frac=1, random_state=42)
df_shuffled

# 행 인덱스 기준으로 정렬
df5 = df_shuffled.sort_index()
df5

# 열 이름 기준으로 정렬 (알파벳순)
df6 = df.sort_index(axis=1)
df6

   반   이름  점수
2  1  이영희  85
1  1  김철수  70
3  2  박민수  95
0  2  홍길동  90

In [114]:
# 실습 3
df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'score': [88,95,70,100]
})
# 1.
an1 = df.sort_values('score')
print(an1)
print()
# 2.
an2 = df.sort_values('score', ascending=False).reset_index(drop=True)
print(an2)

      name  score
2  Charlie     70
0    Alice     88
1      Bob     95
3    David    100

      name  score
0    David    100
1      Bob     95
2    Alice     88
3  Charlie     70

In [128]:
df = pd.DataFrame({\
    '이름': ['가','나','다','라','마'],
    '반': [2,1,1,2,1],
    '점수': [90,85,80,95,85]
})
# 3.
an3 = df.sort_values(['반','점수'], ascending=[True, False]).reset_index(drop=True)
print(an3)
print()
# 4.
an4 = df.sort_index(axis=1)
print(an4)

  이름  반  점수
0  나  1  85
1  마  1  85
2  다  1  80
3  라  2  95
4  가  2  90

   반 이름  점수
0  2  가  90
1  1  나  85
2  1  다  80
3  2  라  95
4  1  마  85

In [121]:
df = pd.DataFrame({
    'value': [10,20,30,40]
},index=[3,1,4,2])
# 5.
an5 = df.sort_index()
print(an5)
print()
# 6.
an6_1 = df.sort_index(ascending=False)
an6_2 = df.sort_values('value')
print("인덱스 내림차순 정렬:\n", an6_1)
print("value 컬럼 오름차순 정렬:\n", an6_2)

   value
1     20
2     40
3     10
4     30

인덱스 내림차순 정렬:
    value
4     30
3     10
2     40
1     20
value 컬럼 오름차순 정렬:
    value
3     10
1     20
4     30
2     40

### groupby

In [132]:
df = pd.DataFrame({
    'team': ['A','A','B','B','B','C'],
    'name': ['Kim','Lee','Park','Choi','Jung','Han'],
    'score': [90,85,80,70,95,88]
})
df

# 단일 컬럼 기준 그룹화
grouped = df.groupby('team')

# 집계함수 적용
result_sum = grouped['score'].sum()
print(result_sum)

# 평균
result_mean = grouped['score'].mean()
print(result_mean)

# 개수
result_count = grouped['score'].count()
print(result_count)

team
A    175
B    245
C     88
Name: score, dtype: int64
team
A    87.500000
B    81.666667
C    88.000000
Name: score, dtype: float64
team
A    2
B    3
C    1
Name: score, dtype: int64

In [133]:
df2 = pd.DataFrame({
    'team': ['A','A','B','B','B','C'],
    'gender': ['M','F','F','M','M','F'],
    'score': [90,85,80,70,95,88],
    'age' : [21, 22, 23, 25, 20, 27]
})
df2

  team gender  score  age
0    A      M     90   21
1    A      F     85   22
2    B      F     80   23
3    B      M     70   25
4    B      M     95   20
5    C      F     88   27

In [134]:
# 여러 컬럼 기준 그룹화
result = df2.groupby(['team','gender'])['score'].mean()
result

team  gender
A     F         85.0
      M         90.0
B     F         80.0
      M         82.5
C     F         88.0
Name: score, dtype: float64

In [135]:
# as_index=False 옵션
# 그룹라벨이 인덱스로 설정됨
result = df2.groupby('team', as_index=False)['score'].sum()
result

  team  score
0    A    175
1    B    245
2    C     88

In [136]:
# 여러 집계 함수를 한번에 적용: agg()
result = df2.groupby('team', as_index=False)['score'].agg(['sum','mean','count'])
result

  team  sum       mean  count
0    A  175  87.500000      2
1    B  245  81.666667      3
2    C   88  88.000000      1

In [138]:
# 그룹별로 여러 컬럼에 다른 집계 함수 적용
result = df2.groupby('team').agg({
    'score': 'mean',
    'age': 'max'
})
result

          score  age
team
A     87.500000   22
B     81.666667   25
C     88.000000   27

In [ ]:
# 실습 4.
# 1.
df = pd.DataFrame({
    'grade': [1,2,1,2,1,3],
    'name': ['Kim','Lee','Park','Choi','Jung','Han'],
    'kor': [85,78,90,92,80,75]
})
an1 = df.groupby('grade')['kor'].mean()
print(an1)

grade
1    85.0
2    85.0
3    75.0
Name: kor, dtype: float64

In [ ]:
# 2.
df = pd.DataFrame({
    'class': [1,1,1,2,2,2],
    'subject': ['Math','Math','Eng','Math','Eng','Eng'],
    'score': [80,90,85,70,95,90]
})
an2 = df.groupby(['class','subject']).agg(
    count = ('score', 'count'),
    avg = ('score', 'mean')      
)
print(an2)

               count   avg
class subject
1     Eng          1  85.0
      Math         2  85.0
2     Eng          2  92.5
      Math         1  70.0

In [141]:
# 3.
df = pd.DataFrame({
    'region': ['Seoul','Seoul','Busan','Busan','Daegu'],
    'seller': ['A','B','A','B','A'],
    'sales': [100,200,150,120,130]
})
an3 = df.groupby(['region','seller']).agg(
    t_sales = ('sales','sum'),
    m_sales = ('sales','max')
)
print(an3)

               t_sales  m_sales
region seller
Busan  A           150      150
       B           120      120
Daegu  A           130      130
Seoul  A           100      100
       B           200      200

In [142]:
# 4.
df = pd.DataFrame({
    'team': ['A','A','B','B','A','B'],
    'position': ['FW','DF','FW','DF','DF','FW'],
    'score': [3,2,None,1,4,2]
})
an4 = df.groupby(['team','position'])['score'].mean()
print(an4)

team  position
A     DF          3.0
      FW          3.0
B     DF          1.0
      FW          2.0
Name: score, dtype: float64

In [144]:
# 5.
df = pd.DataFrame({
    'dept': ['HR','HR','IT','IT','Sales','Sales'],
    'gender': ['M','F','F','M','F','F'],
    'salary': [3500,3200,4000,4200,3000,3100]
})
an5 = df.groupby(['dept','gender']).agg(
    count = ('salary','count'),
    t_salary = ('salary','sum')
)
print(an5)

              count  t_salary
dept  gender
HR    F           1      3200
      M           1      3500
IT    F           1      4000
      M           1      4200
Sales F           2      6100